# frozen_string_literal: true

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'heroku/brew'

brew 'git'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'curl'
brew 'gawk'
brew 'imagemagick'
brew 'jpegoptim'
brew 'optipng'
brew 'tmux'
brew 'mas'
brew 'zsh'

brew 'bat'
brew 'exa'

# GitHub
brew 'gh'
cask 'github'

# Version manager
brew 'asdf'

# Development
brew 'heroku'
brew 'memcached', restart_service: true
brew 'redis', restart_service: true
cask 'postgres-unofficial'
cask 'docker'
brew 'overmind'

# Image tools
cask 'imagealpha'
cask 'imageoptim'

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'brave-browser'

# Code editor
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Misc
brew 'starship'

# cask 'alfred'
cask 'around'
cask 'balsamiq-wireframes'
cask 'camo-studio'
cask 'gpg-suite'
cask 'keka'
cask 'ngrok'
cask 'omnidisksweeper'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'toggl-track'
cask 'zoom'

# From the mac appstore
mas 'Teampaper Snap', id: 1199502670
# mas 'Xcode', id: 497799835
